assignment/httperf/output.txt
Starting httperf open-load experiments
=====================================

===== RATE: 10 req/s =====
Fri Jan 30 03:44:18 AM IST 2026
httperf --client=0/1 --server=10.51.29.70 --port=80 --uri=/test.php --rate=10 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --num-conns=5000 --num-calls=1
Maximum connect burst length: 1

Total: connections 5000 requests 5000 replies 5000 test-duration 499.919 s

Connection rate: 10.0 conn/s (100.0 ms/conn, <=32 concurrent connections)
Connection time [ms]: min 10.4 avg 41.7 max 3313.6 median 17.5 stddev 161.2
Connection time [ms]: connect 26.3
Connection length [replies/conn]: 1.000

Request rate: 10.0 req/s (100.0 ms/req)
Request size [B]: 72.0

Reply rate [replies/s]: min 6.6 avg 10.0 max 13.4 stddev 0.5 (99 samples)
Reply time [ms]: response 15.4 transfer 0.0
Reply size [B]: header 148.0 content 64.0 footer 0.0 (total 212.0)
Reply status: 1xx=0 2xx=5000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 363.02 system 136.75 (user 72.6% system 27.4% total 100.0%)
Net I/O: 2.8 KB/s (0.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

===== RATE: 50 req/s =====
Fri Jan 30 03:52:48 AM IST 2026
httperf --client=0/1 --server=10.51.29.70 --port=80 --uri=/test.php --rate=50 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --num-conns=5000 --num-calls=1
Maximum connect burst length: 1

Total: connections 5000 requests 5000 replies 5000 test-duration 99.994 s

Connection rate: 50.0 conn/s (20.0 ms/conn, <=11 concurrent connections)
Connection time [ms]: min 9.1 avg 18.2 max 314.0 median 16.5 stddev 13.3
Connection time [ms]: connect 8.1
Connection length [replies/conn]: 1.000

Request rate: 50.0 req/s (20.0 ms/req)
Request size [B]: 72.0

Reply rate [replies/s]: min 49.8 avg 50.0 max 50.2 stddev 0.1 (19 samples)
Reply time [ms]: response 10.0 transfer 0.0
Reply size [B]: header 148.0 content 64.0 footer 0.0 (total 212.0)
Reply status: 1xx=0 2xx=5000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 72.28 system 27.61 (user 72.3% system 27.6% total 99.9%)
Net I/O: 13.9 KB/s (0.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

===== RATE: 100 req/s =====
Fri Jan 30 03:54:38 AM IST 2026
httperf --client=0/1 --server=10.51.29.70 --port=80 --uri=/test.php --rate=100 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --num-conns=5000 --num-calls=1
Maximum connect burst length: 1

Total: connections 5000 requests 5000 replies 5000 test-duration 50.003 s

Connection rate: 100.0 conn/s (10.0 ms/conn, <=21 concurrent connections)
Connection time [ms]: min 8.5 avg 17.7 max 1069.3 median 15.5 stddev 27.0
Connection time [ms]: connect 8.1
Connection length [replies/conn]: 1.000

Request rate: 100.0 req/s (10.0 ms/req)
Request size [B]: 72.0

Reply rate [replies/s]: min 99.8 avg 100.0 max 100.2 stddev 0.1 (10 samples)
Reply time [ms]: response 9.6 transfer 0.0
Reply size [B]: header 148.0 content 64.0 footer 0.0 (total 212.0)
Reply status: 1xx=0 2xx=5000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 36.15 system 13.82 (user 72.3% system 27.6% total 99.9%)
Net I/O: 27.8 KB/s (0.2*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

===== RATE: 200 req/s =====
Fri Jan 30 03:55:38 AM IST 2026
httperf --client=0/1 --server=10.51.29.70 --port=80 --uri=/test.php --rate=200 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --num-conns=5000 --num-calls=1
Maximum connect burst length: 1

Total: connections 5000 requests 5000 replies 4992 test-duration 25.008 s

Connection rate: 199.9 conn/s (5.0 ms/conn, <=45 concurrent connections)
Connection time [ms]: min 7.9 avg 18.1 max 1063.8 median 15.5 stddev 35.2
Connection time [ms]: connect 8.8
Connection length [replies/conn]: 1.000

Request rate: 199.9 req/s (5.0 ms/req)
Request size [B]: 72.0

Reply rate [replies/s]: min 198.4 avg 199.6 max 200.2 stddev 0.7 (5 samples)
Reply time [ms]: response 9.3 transfer 0.0
Reply size [B]: header 148.0 content 63.0 footer 0.0 (total 211.0)
Reply status: 1xx=0 2xx=4992 3xx=0 4xx=0 5xx=0

CPU time [s]: user 17.98 system 6.98 (user 71.9% system 27.9% total 99.8%)
Net I/O: 55.3 KB/s (0.5*10^6 bps)

Errors: total 8 client-timo 0 socket-timo 0 connrefused 0 connreset 8
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

===== RATE: 300 req/s =====
Fri Jan 30 03:56:13 AM IST 2026
httperf --client=0/1 --server=10.51.29.70 --port=80 --uri=/test.php --rate=300 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --num-conns=5000 --num-calls=1
Maximum connect burst length: 1

Total: connections 5000 requests 5000 replies 5000 test-duration 16.682 s

Connection rate: 299.7 conn/s (3.3 ms/conn, <=43 concurrent connections)
Connection time [ms]: min 7.6 avg 17.0 max 141.6 median 15.5 stddev 9.6
Connection time [ms]: connect 7.5
Connection length [replies/conn]: 1.000

Request rate: 299.7 req/s (3.3 ms/req)
Request size [B]: 72.0

Reply rate [replies/s]: min 299.2 avg 299.7 max 300.0 stddev 0.5 (3 samples)
Reply time [ms]: response 9.5 transfer 0.0
Reply size [B]: header 148.0 content 62.0 footer 0.0 (total 210.0)
Reply status: 1xx=0 2xx=5000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 11.53 system 5.02 (user 69.1% system 30.1% total 99.2%)
Net I/O: 82.8 KB/s (0.7*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

===== RATE: 500 req/s =====
Fri Jan 30 03:56:40 AM IST 2026
httperf --client=0/1 --server=10.51.29.70 --port=80 --uri=/test.php --rate=500 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --num-conns=5000 --num-calls=1
Maximum connect burst length: 1

Total: connections 5000 requests 5000 replies 2208 test-duration 999.775 s

Connection rate: 5.0 conn/s (200.0 ms/conn, <=1080 concurrent connections)
Connection time [ms]: min 8.9 avg 961.5 max 11291.1 median 17.5 stddev 2550.7
Connection time [ms]: connect 1299.4
Connection length [replies/conn]: 1.000

Request rate: 5.0 req/s (200.0 ms/req)
Request size [B]: 72.0

Reply rate [replies/s]: min 0.0 avg 2.2 max 276.2 stddev 21.1 (199 samples)
Reply time [ms]: response 14.1 transfer 0.0
Reply size [B]: header 148.0 content 61.0 footer 0.0 (total 209.0)
Reply status: 1xx=0 2xx=2208 3xx=0 4xx=0 5xx=0

CPU time [s]: user 676.90 system 322.25 (user 67.7% system 32.2% total 99.9%)
Net I/O: 0.8 KB/s (0.0*10^6 bps)

Errors: total 2792 client-timo 0 socket-timo 5 connrefused 0 connreset 2787
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

===== RATE: 700 req/s =====
Fri Jan 30 04:13:30 AM IST 2026
httperf --client=0/1 --server=10.51.29.70 --port=80 --uri=/test.php --rate=700 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --num-conns=5000 --num-calls=1
Maximum connect burst length: 1

Total: connections 5000 requests 5000 replies 4969 test-duration 7.737 s

Connection rate: 646.3 conn/s (1.5 ms/conn, <=100 concurrent connections)
Connection time [ms]: min 9.2 avg 54.3 max 2098.6 median 17.5 stddev 206.1
Connection time [ms]: connect 43.5
Connection length [replies/conn]: 1.000

Request rate: 646.3 req/s (1.5 ms/req)
Request size [B]: 72.0

Reply rate [replies/s]: min 689.6 avg 689.6 max 689.6 stddev 0.0 (1 samples)
Reply time [ms]: response 10.8 transfer 0.0
Reply size [B]: header 148.0 content 62.0 footer 0.0 (total 210.0)
Reply status: 1xx=0 2xx=4969 3xx=0 4xx=0 5xx=0

CPU time [s]: user 5.42 system 2.27 (user 70.0% system 29.4% total 99.5%)
Net I/O: 177.2 KB/s (1.5*10^6 bps)

Errors: total 31 client-timo 0 socket-timo 0 connrefused 0 connreset 31
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

===== RATE: 800 req/s =====
Fri Jan 30 04:13:47 AM IST 2026
httperf --client=0/1 --server=10.51.29.70 --port=80 --uri=/test.php --rate=800 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --num-conns=5000 --num-calls=1
Maximum connect burst length: 1

Total: connections 5000 requests 5000 replies 4937 test-duration 7.271 s

Connection rate: 687.6 conn/s (1.5 ms/conn, <=133 concurrent connections)
Connection time [ms]: min 9.2 avg 77.2 max 1106.3 median 18.5 stddev 236.5
Connection time [ms]: connect 65.5
Connection length [replies/conn]: 1.000

Request rate: 687.6 req/s (1.5 ms/req)
Request size [B]: 72.0

Reply rate [replies/s]: min 776.4 avg 776.4 max 776.4 stddev 0.0 (1 samples)
Reply time [ms]: response 11.4 transfer 0.0
Reply size [B]: header 148.0 content 61.0 footer 0.0 (total 209.0)
Reply status: 1xx=0 2xx=4937 3xx=0 4xx=0 5xx=0

CPU time [s]: user 4.95 system 2.22 (user 68.0% system 30.6% total 98.6%)
Net I/O: 187.3 KB/s (1.5*10^6 bps)

Errors: total 63 client-timo 0 socket-timo 0 connrefused 0 connreset 63
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0