assignment/httperf/output1.txt
Starting httperf open-load experiments
=====================================

===== RATE: 500 req/s =====
Fri Jan 30 04:14:44 AM IST 2026
httperf --client=0/1 --server=10.51.29.70 --port=80 --uri=/test.php --rate=500 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --num-conns=5000 --num-calls=1
Maximum connect burst length: 1

Total: connections 5000 requests 5000 replies 5000 test-duration 10.011 s

Connection rate: 499.4 conn/s (2.0 ms/conn, <=30 concurrent connections)
Connection time [ms]: min 8.9 avg 21.0 max 1077.8 median 16.5 stddev 63.9
Connection time [ms]: connect 11.4
Connection length [replies/conn]: 1.000

Request rate: 499.4 req/s (2.0 ms/req)
Request size [B]: 72.0

Reply rate [replies/s]: min 497.2 avg 499.4 max 501.6 stddev 3.1 (2 samples)
Reply time [ms]: response 9.6 transfer 0.0
Reply size [B]: header 148.0 content 61.0 footer 0.0 (total 209.0)
Reply status: 1xx=0 2xx=5000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 7.08 system 2.89 (user 70.7% system 28.9% total 99.6%)
Net I/O: 137.5 KB/s (1.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

===== RATE: 700 req/s =====
Fri Jan 30 04:15:04 AM IST 2026
httperf --client=0/1 --server=10.51.29.70 --port=80 --uri=/test.php --rate=700 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --num-conns=5000 --num-calls=1
Maximum connect burst length: 1

Total: connections 5000 requests 5000 replies 767 test-duration 251.886 s

Connection rate: 19.9 conn/s (50.4 ms/conn, <=1557 concurrent connections)
Connection time [ms]: min 10.6 avg 23.9 max 1076.6 median 17.5 stddev 76.2
Connection time [ms]: connect 1441.9
Connection length [replies/conn]: 1.000

Request rate: 19.9 req/s (50.4 ms/req)
Request size [B]: 72.0

Reply rate [replies/s]: min 0.0 avg 3.1 max 153.2 stddev 21.7 (50 samples)
Reply time [ms]: response 10.5 transfer 0.0
Reply size [B]: header 148.0 content 61.0 footer 0.0 (total 209.0)
Reply status: 1xx=0 2xx=767 3xx=0 4xx=0 5xx=0

CPU time [s]: user 169.54 system 81.34 (user 67.3% system 32.3% total 99.6%)
Net I/O: 2.0 KB/s (0.0*10^6 bps)

Errors: total 4221 client-timo 0 socket-timo 0 connrefused 0 connreset 4221
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0