assignment/httperf/output2.txt
Starting httperf open-load experiments
=====================================

===== RATE: 800 req/s =====
Fri Jan 30 04:20:51 AM IST 2026
httperf --client=0/1 --server=10.51.29.70 --port=80 --uri=/test.php --rate=800 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --num-conns=5000 --num-calls=1
Maximum connect burst length: 1

Total: connections 5000 requests 5000 replies 4996 test-duration 7.274 s

Connection rate: 687.4 conn/s (1.5 ms/conn, <=77 concurrent connections)
Connection time [ms]: min 8.8 avg 70.7 max 1101.1 median 17.5 stddev 225.9
Connection time [ms]: connect 60.0
Connection length [replies/conn]: 1.000

Request rate: 687.4 req/s (1.5 ms/req)
Request size [B]: 72.0

Reply rate [replies/s]: min 787.4 avg 787.4 max 787.4 stddev 0.0 (1 samples)
Reply time [ms]: response 10.7 transfer 0.0
Reply size [B]: header 148.0 content 61.0 footer 0.0 (total 209.0)
Reply status: 1xx=0 2xx=4996 3xx=0 4xx=0 5xx=0

CPU time [s]: user 4.98 system 2.24 (user 68.5% system 30.7% total 99.3%)
Net I/O: 189.0 KB/s (1.5*10^6 bps)

Errors: total 4 client-timo 0 socket-timo 0 connrefused 0 connreset 4
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

===== RATE: 900 req/s =====
Fri Jan 30 04:21:08 AM IST 2026
httperf --client=0/1 --server=10.51.29.70 --port=80 --uri=/test.php --rate=900 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --num-conns=5000 --num-calls=1
Maximum connect burst length: 1

Total: connections 5000 requests 5000 replies 4909 test-duration 6.565 s

Connection rate: 761.6 conn/s (1.3 ms/conn, <=229 concurrent connections)
Connection time [ms]: min 9.2 avg 102.0 max 2108.4 median 19.5 stddev 286.1
Connection time [ms]: connect 91.4
Connection length [replies/conn]: 1.000

Request rate: 761.6 req/s (1.3 ms/req)
Request size [B]: 72.0

Reply rate [replies/s]: min 863.0 avg 863.0 max 863.0 stddev 0.0 (1 samples)
Reply time [ms]: response 13.0 transfer 0.0
Reply size [B]: header 148.0 content 61.0 footer 0.0 (total 209.0)
Reply status: 1xx=0 2xx=4909 3xx=0 4xx=0 5xx=0

CPU time [s]: user 4.41 system 2.05 (user 67.2% system 31.3% total 98.5%)
Net I/O: 206.7 KB/s (1.7*10^6 bps)

Errors: total 91 client-timo 0 socket-timo 0 connrefused 0 connreset 91
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

===== RATE: 1000 req/s =====
Fri Jan 30 04:21:25 AM IST 2026
httperf --client=0/1 --server=10.51.29.70 --port=80 --uri=/test.php --rate=1000 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --num-conns=5000 --num-calls=1
Maximum connect burst length: 2

Total: connections 5000 requests 5000 replies 4946 test-duration 6.063 s

Connection rate: 824.6 conn/s (1.2 ms/conn, <=239 concurrent connections)
Connection time [ms]: min 9.5 avg 201.8 max 2117.8 median 23.5 stddev 435.7
Connection time [ms]: connect 185.6
Connection length [replies/conn]: 1.000

Request rate: 824.6 req/s (1.2 ms/req)
Request size [B]: 72.0

Reply rate [replies/s]: min 947.0 avg 947.0 max 947.0 stddev 0.0 (1 samples)
Reply time [ms]: response 18.0 transfer 0.0
Reply size [B]: header 148.0 content 61.0 footer 0.0 (total 209.0)
Reply status: 1xx=0 2xx=4946 3xx=0 4xx=0 5xx=0

CPU time [s]: user 3.53 system 2.48 (user 58.2% system 40.9% total 99.1%)
Net I/O: 225.1 KB/s (1.8*10^6 bps)

Errors: total 54 client-timo 0 socket-timo 0 connrefused 0 connreset 54
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
=====================================
All experiments completed